Конфигурация/InformationRegisters/УсловияДоговоровОбщие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияДоговоровОбщие</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаРасторжения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантНачалаСрока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНачалаСрока</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантДлиныСрока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыДлиныСрока</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АгентскийДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскогоДепозита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскогоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БрокерскогоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВедениеРеестраВладельцевИменныхЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеденияРеестра</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенСоглашениеПоДепозитнымВкладам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенСоглашениеПоКонверсионнымОперациям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДДУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоверительногоУправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорКуплиПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорСтрахования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнениеПравил</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Залога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаПогашениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоммунальныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомплексногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МировоеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОказанияАудиторскихУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственногоХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оценки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаПроведениеИдентификации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поручительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрационногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбОтступном</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпецДепозитарногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпецРегистрационногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительствоНаСвоемУчастке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительствоНаЧужомУчастке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрудовойДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Цессии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ТипыДепозитарныхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыДепозитарныхСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Собственный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Депозитарный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазделДепозитарногоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственноеХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лицевой</Name>
					<Comment>Такие счета используются для ведения реестров ЦБ у регистраторов</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/ДепозитарныеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДепозитарныеСчета</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДепозитарныхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДепозитарныхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депозитарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Эмитенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодчиненныеРазделы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Попекаемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Попечитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПопечения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Транзитный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетТипаС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойЛицевойСчетВЕСИАФинанс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СовместноеВладение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБанковскогоСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыБанковскихСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУправленияДовереннымиСредствами</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетТипаС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкДляРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДоговораМНО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКорреспондента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНазначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Транзитный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранзитныйПИФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорМНО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомерФилиалаКредитнойОрганизации</Name>
					<Comment>Указывается для филиалов, </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорЦессии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/CommonModules/РаботаСИсполнителями/Ext/Module.bsl
Функция ДепозитарийЕстьВИсполнителе(Организация, Период, Депозитарий, СчетДоверительногоУправления) Экспорт
	
	Если Не ЗначениеЗаполнено(Организация) Или Не ЗначениеЗаполнено(Депозитарий) Или Не ЗначениеЗаполнено(СчетДоверительногоУправления) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет
		|ИЗ
		|	РегистрСведений.ИсполнителиПоЦеннымБумагам КАК ИсполнителиПоЦеннымБумагам
		|ГДЕ
		|	ИсполнителиПоЦеннымБумагам.Организация = &Организация
		|	И ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Депозитарий = &Депозитарий
		|	И (ИсполнителиПоЦеннымБумагам.ДатаЗакрытия <= &ДатаЗакрытия
		|			ИЛИ ИсполнителиПоЦеннымБумагам.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))";
		
	Запрос.УстановитьПараметр("Организация",                  Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Депозитарий",                  Депозитарий);
	Запрос.УстановитьПараметр("ДатаЗакрытия",                 Период);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции // ДепозитарийЕстьВИсполнителе

////////////////////////////////////////////////////////////////////////////////
// ДАТА ЗАКРЫТИЯ

// Устанавливает дату закрытия во всех исполнителях
//
// Параметры
//  - СчетУчета   : ссылка на справочник депозитарных или банковских счетов
//  - ДатаЗакрытия: новая дата закрытия
//
// Описание
//   Проверяет, совпадает ли в исполнителе-регистре сведений дата закрытия
//   по счету учета с переданной датой, и если не совпадает, то изменяет дату закрытия
//   на переданную.
//
Процедура УстановитьДатуЗакрытия(СчетУчета, ДатаЗакрытия) Экспорт
	
	Если      ТипЗнч(СчетУчета) = Тип("СправочникСсылка.ДепозитарныеСчета") Тогда
		ИзменитьДатуЗакрытияВИсполнителе("ИсполнителиПоЦеннымБумагам", "ДепозитарныйСчет", СчетУчета, ДатаЗакрытия);
		
	ИначеЕсли ТипЗнч(СчетУчета) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
		ИзменитьДатуЗакрытияВИсполнителе("ИсполнителиПоДенежнымСредствамБрокерские",  "РасчетныйСчет", СчетУчета, ДатаЗакрытия);
		ИзменитьДатуЗакрытияВИсполнителе("ИсполнителиПоДенежнымСредствамСобственные", "РасчетныйСчет", СчетУчета, ДатаЗакрытия);
		
	КонецЕсли;
		
КонецПроцедуры // УстановитьДатуЗакрытия

Процедура ИзменитьДатуЗакрытияВИсполнителе(ВидИсполнителя, ВидСчетаУчета, СчетУчета, ДатаЗакрытия)
	
	Если Не ЗначениеЗаполнено(ДатаЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	
	// заблокируем данные для изменения
	Если Не МонопольныйРежим() Тогда
		Блокировка = Новый БлокировкаДанных;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений." + ВидИсполнителя);
		ЭлементБлокировки.УстановитьЗначение(ВидСчетаУчета, СчетУчета);
		
		Блокировка.Заблокировать();
	КонецЕсли;
	
	// проверим, существуют ли записи по данному счету учета,
	// дата закрытия которых отличается от переданной
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Исполнители.ДатаЗакрытия
		|ИЗ
		|	РегистрСведений." + ВидИсполнителя + " КАК Исполнители
		|ГДЕ
		|	" + ВидСчетаУчета + " = &СчетУчета И (ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1) ИЛИ ДатаЗакрытия > &ДатаЗакрытия)";
		
	Запрос.УстановитьПараметр("СчетУчета",    СчетУчета);
	Запрос.УстановитьПараметр("ДатаЗакрытия", ДатаЗакрытия);
		
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерНабораЗаписей = РегистрыСведений[ВидИсполнителя].СоздатьНаборЗаписей();
	МенеджерНабораЗаписей.Отбор[ВидСчетаУчета].Установить(СчетУчета);
	МенеджерНабораЗаписей.Прочитать();
	
	Для каждого МенеджерЗаписи Из МенеджерНабораЗаписей Цикл
		Если Не ЗначениеЗаполнено(МенеджерЗаписи.ДатаЗакрытия) Или (МенеджерЗаписи.ДатаЗакрытия > ДатаЗакрытия) Тогда
			МенеджерЗаписи.ДатаЗакрытия = ДатаЗакрытия;
		КонецЕсли;
	КонецЦикла;
	
	МенеджерНабораЗаписей.Записать();
	
КонецПроцедуры // ИзменитьДатуЗакрытияВИсполнителе

Функция ПроверитьДатыЗакрытияДочернихЭлементов(Объект, Отказ) Экспорт
	
	РезультатПроверки = Истина;	
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Договоры") Тогда
		ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "ВидДоговора");	
	КонецЕсли;		
	
	Если ВидДоговора = Перечисления.ВидыДоговоров.ДепозитарногоОбслуживания
		ИЛИ ВидДоговора = Перечисления.ВидыДоговоров.ОтветственногоХранения
		ИЛИ ВидДоговора = Перечисления.ВидыДоговоров.ВеденияРеестра
		ИЛИ ВидДоговора = Перечисления.ВидыДоговоров.СпецДепозитарногоОбслуживания
		ИЛИ ВидДоговора = Перечисления.ВидыДоговоров.СпецРегистрационногоОбслуживания Тогда
		
		// Проверяем депозитарные счета
		
		РеквизитыДоговора = РаботаСНормативноСправочнойИнформацией.ПолучитьРеквизитыДоговора(Объект.Ссылка, "ДатаРасторжения");
		Если Не ЗначениеЗаполнено(РеквизитыДоговора.ДатаРасторжения) Тогда
			Возврат РезультатПроверки;
		КонецЕсли;
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДепозитарныеСчета.Ссылка КАК Ссылка,
			|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДепозитарныеСчета.Ссылка) КАК Представление
			|ИЗ
			|	Справочник.ДепозитарныеСчета КАК ДепозитарныеСчета
			|ГДЕ
			|	ДепозитарныеСчета.Договор = &Договор
			|	И ДепозитарныеСчета.ПометкаУдаления = ЛОЖЬ
			|	И (ДепозитарныеСчета.ДатаЗакрытия > &ДатаЗакрытия
			|			ИЛИ ДепозитарныеСчета.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))");
		
		Запрос.УстановитьПараметр("Договор", Объект.Ссылка);
		Запрос.УстановитьПараметр("ДатаЗакрытия", РеквизитыДоговора.ДатаРасторжения);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			РезультатПроверки = Ложь;
			
			ВыборкаЗапроса = РезультатЗапроса.Выбрать();
			Пока ВыборкаЗапроса.Следующий() Цикл
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата закрытия счета «" + ВыборкаЗапроса.Представление + "» позже даты расторжения договора", ВыборкаЗапроса.Ссылка, , , Отказ);
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникОбъект.ДепозитарныеСчета") Тогда	
		
		// Проверяем разделы счета и исполнителей
		
		Если Не ЗначениеЗаполнено(Объект.ДатаЗакрытия) Тогда
			Возврат РезультатПроверки;
		КонецЕсли;
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	"" раздела "" КАК Тип,
			|	ДепозитарныеСчета.Ссылка КАК Ссылка,
			|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДепозитарныеСчета.Ссылка) КАК Представление
			|ИЗ
			|	Справочник.ДепозитарныеСчета КАК ДепозитарныеСчета
			|ГДЕ
			|	ДепозитарныеСчета.Родитель = &ДепозитарныйСчет
			|	И ДепозитарныеСчета.ПометкаУдаления = ЛОЖЬ
			|	И (ДепозитарныеСчета.ДатаЗакрытия > &ДатаЗакрытия
			|			ИЛИ ДепозитарныеСчета.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	"" исполнителя "",
			|	ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления,
			|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления)
			|ИЗ
			|	РегистрСведений.ИсполнителиПоЦеннымБумагам КАК ИсполнителиПоЦеннымБумагам
			|ГДЕ
			|	ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет = &ДепозитарныйСчет
			|	И (ИсполнителиПоЦеннымБумагам.ДатаЗакрытия > &ДатаЗакрытия
			|			ИЛИ ИсполнителиПоЦеннымБумагам.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))");
		
		Запрос.УстановитьПараметр("ДепозитарныйСчет", Объект.Ссылка);
		Запрос.УстановитьПараметр("ДатаЗакрытия", Объект.ДатаЗакрытия);		
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			РезультатПроверки = Ложь;
			
			ВыборкаЗапроса = РезультатЗапроса.Выбрать();
			Пока ВыборкаЗапроса.Следующий() Цикл
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата закрытия" + ВыборкаЗапроса.Тип + "«" + ВыборкаЗапроса.Представление + "» позже дата закрытия счета", ВыборкаЗапроса.Ссылка, , , Отказ);
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникОбъект.ДоговорыБрокерскогоОбслуживания")
			ИЛИ ВидДоговора = Перечисления.ВидыДоговоров.БрокерскогоОбслуживания Тогда
		
		// Проверяем исполнителей по д/с брокерские
		
		РеквизитыДоговора = РаботаСНормативноСправочнойИнформацией.ПолучитьРеквизитыДоговора(Объект.Ссылка, "ДатаРасторжения");
		Если Не ЗначениеЗаполнено(РеквизитыДоговора.ДатаРасторжения) Тогда
			Возврат РезультатПроверки;
		КонецЕсли;
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИсполнителиПоДСБрокерские.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ИсполнителиПоДСБрокерские.РасчетныйСчет КАК РасчетныйСчет,
			|	ИсполнителиПоДСБрокерские.ДатаЗакрытия КАК ДатаЗакрытия
			|ИЗ
			|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
			|			,
			|			Организация = &Организация
			|				И Брокер.ЮрФизЛицо = &Контрагент) КАК ДоговорыСБрокерами
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиПоДенежнымСредствамБрокерские КАК ИсполнителиПоДСБрокерские
			|		ПО (ИсполнителиПоДСБрокерские.Организация = ДоговорыСБрокерами.Организация)
			|			И (ИсполнителиПоДСБрокерские.СчетДоверительногоУправления = ДоговорыСБрокерами.СчетДоверительногоУправления)
			|			И (ИсполнителиПоДСБрокерские.Брокер = ДоговорыСБрокерами.Брокер)
			|			И (ИсполнителиПоДСБрокерские.ДатаЗакрытия > &ДатаЗакрытия
			|				ИЛИ ИсполнителиПоДСБрокерские.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))
			|ГДЕ
			|	ДоговорыСБрокерами.ДоговорБрокерскогоОбслуживания = &Договор");
		
		Запрос.УстановитьПараметр("Договор",		Объект.Ссылка);
		Запрос.УстановитьПараметр("Организация",	Объект.Организация);
		Запрос.УстановитьПараметр("Контрагент",		Объект.Контрагент);
		Запрос.УстановитьПараметр("ДатаЗакрытия",	РеквизитыДоговора.ДатаРасторжения);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			РезультатПроверки = Ложь;
			
			ВыборкаЗапроса = РезультатЗапроса.Выбрать();
			Пока ВыборкаЗапроса.Следующий() Цикл
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата закрытия исполнителя «" + Строка(ВыборкаЗапроса.СчетДоверительногоУправления) + "» по счету брокера «" + Строка(ВыборкаЗапроса.РасчетныйСчет) + "» позже даты расторжения договора", ВыборкаЗапроса.СчетДоверительногоУправления, , , Отказ);
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникОбъект.БанковскиеСчета") Тогда
		
		// Проверяем исполнителей по д/с собственные
		
		Если Не ЗначениеЗаполнено(Объект.ДатаЗакрытия) Тогда
			Возврат РезультатПроверки;
		КонецЕсли;
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления) КАК Представление
			|ИЗ
			|	РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
			|ГДЕ
			|	ИсполнителиПоДенежнымСредствамСобственные.Организация = &Организация
			|	И ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет = &РасчетныйСчет
			|	И (ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия > &ДатаЗакрытия
			|			ИЛИ ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))");
		
		Запрос.УстановитьПараметр("РасчетныйСчет", Объект.Ссылка);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("ДатаЗакрытия", Объект.ДатаЗакрытия);		
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			РезультатПроверки = Ложь;
			
			ВыборкаЗапроса = РезультатЗапроса.Выбрать();
			Пока ВыборкаЗапроса.Следующий() Цикл
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата закрытия исполнителя «" + ВыборкаЗапроса.Представление + "» позже даты закрытия счета", ВыборкаЗапроса.СчетДоверительногоУправления, , , Отказ);
			КонецЦикла;
		КонецЕсли;

	КонецЕсли;
	
	Возврат РезультатПроверки;	
	
КонецФункции

Функция ПолучитьДоговор(Объект, Период = Неопределено) Экспорт
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.ДоговорыБрокерскогоОбслуживания")
		ИЛИ ТипЗнч(Объект) = Тип("СправочникСсылка.Договоры") Тогда
		
		Возврат Объект;
		
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.ДепозитарныеСчета")
		ИЛИ ТипЗнч(Объект) = Тип("СправочникСсылка.БанковскиеСчета") Тогда	
		
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "Договор");
		
	ИначеЕсли ТипЗнч(Объект) = Тип("РегистрСведенийКлючЗаписи.ИсполнителиПоЦеннымБумагам") Тогда
		
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДепозитарныйСчет, "Договор");
		
	ИначеЕсли ТипЗнч(Объект) = Тип("РегистрСведенийКлючЗаписи.ИсполнителиПоДенежнымСредствамСобственные") Тогда
		
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчет, "Договор");
		
	ИначеЕсли ТипЗнч(Объект) = Тип("РегистрСведенийКлючЗаписи.ИсполнителиПоДенежнымСредствамБрокерские") Тогда
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДоговорыСБрокерами.ДоговорБрокерскогоОбслуживания КАК ДоговорБрокерскогоОбслуживания
			|ИЗ
			|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
			|			&Период,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И Брокер = &Брокер) КАК ДоговорыСБрокерами");
		
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("Брокер", Объект.Брокер);
		Запрос.УстановитьПараметр("Период", Период);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Возврат РезультатЗапроса.Выгрузить()[0].ДоговорБрокерскогоОбслуживания;			
		КонецЕсли;
		
	КонецЕсли;

КонецФункции

Функция ПолучитьДочерниеЭлементы(Объект, Период = Неопределено, Отбор = Неопределено, ОтображатьКорневойУзел = Истина, УникальныйИдентификаторФормы = Неопределено, РодительскийУзел = Неопределено) Экспорт
	
	ЭтоКорневойУзел = Ложь;
	
	ВидыДоговоровДепозитырныхСчетов = Новый Массив;
	ВидыДоговоровДепозитырныхСчетов.Добавить(Перечисления.ВидыДоговоров.ДепозитарногоОбслуживания);
	ВидыДоговоровДепозитырныхСчетов.Добавить(Перечисления.ВидыДоговоров.ОтветственногоХранения);
	ВидыДоговоровДепозитырныхСчетов.Добавить(Перечисления.ВидыДоговоров.ВеденияРеестра);
	ВидыДоговоровДепозитырныхСчетов.Добавить(Перечисления.ВидыДоговоров.СпецДепозитарногоОбслуживания);
	ВидыДоговоровДепозитырныхСчетов.Добавить(Перечисления.ВидыДоговоров.СпецРегистрационногоОбслуживания);

	ВидыДоговоровБанковскихСчетов = Новый Массив;
	ВидыДоговоровБанковскихСчетов.Добавить(Перечисления.ВидыДоговоров.БанковскогоОбслуживания);
	ВидыДоговоровБанковскихСчетов.Добавить(Перечисления.ВидыДоговоров.БанковскогоДепозита);
	ВидыДоговоровБанковскихСчетов.Добавить(Перечисления.ВидыДоговоров.КомплексногоОбслуживания);
	ВидыДоговоровБанковскихСчетов.Добавить(Перечисления.ВидыДоговоров.ГенСоглашениеПоДепозитнымВкладам);
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Договоры") Тогда
		ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "ВидДоговора");	
	КонецЕсли;	
	
	Если ВидДоговора = Перечисления.ВидыДоговоров.ДополнительноеСоглашение 
		И ЗначениеЗаполнено(Объект.Основание) и ТипЗнч(Объект.Основание) = Тип("СправочникСсылка.Договоры") Тогда
		ВидОсновногоДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Основание, "ВидДоговора");
	Иначе
		ВидОсновногоДоговора = Перечисления.ВидыДоговоров.ПустаяСсылка();
	КонецЕсли;
	
	Если РодительскийУзел = Неопределено Тогда
		ЭтоКорневойУзел	 = Истина;
		
		Если ВидыДоговоровДепозитырныхСчетов.Найти(ВидДоговора) <> Неопределено
			ИЛИ ВидыДоговоровДепозитырныхСчетов.Найти(ВидОсновногоДоговора) <> Неопределено
			ИЛИ ТипЗнч(Объект) = Тип("СправочникСсылка.ДепозитарныеСчета")
			ИЛИ ТипЗнч(Объект) = Тип("РегистрСведенийКлючЗаписи.ИсполнителиПоЦеннымБумагам") Тогда
			
			ПредставлениеЭлементов = "Договор / Счет / Раздел / Исполнитель";	
			
		ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.ДоговорыБрокерскогоОбслуживания")
			ИЛИ ВидДоговора = Перечисления.ВидыДоговоров.БрокерскогоОбслуживания
			ИЛИ ТипЗнч(Объект) = Тип("РегистрСведенийКлючЗаписи.ИсполнителиПоДенежнымСредствамБрокерские") Тогда
			
			ПредставлениеЭлементов = "Договор / Исполнитель";	
			
		ИначеЕсли ВидыДоговоровБанковскихСчетов.Найти(ВидДоговора) <> Неопределено
			ИЛИ ВидыДоговоровБанковскихСчетов.Найти(ВидОсновногоДоговора) <> Неопределено
			ИЛИ ТипЗнч(Объект) = Тип("СправочникСсылка.БанковскиеСчета")
			ИЛИ ТипЗнч(Объект) = Тип("РегистрСведенийКлючЗаписи.ИсполнителиПоДенежнымСредствамСобственные") Тогда
			
			ПредставлениеЭлементов = "Договор / Счет / Исполнитель";	
			
		КонецЕсли;		
		
		ДеревоРезультат = Новый ДеревоЗначений;
		ДеревоРезультат.Колонки.Добавить("Элемент");
		ДеревоРезультат.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"), ПредставлениеЭлементов);
		ДеревоРезультат.Колонки.Добавить("ДанныеКартинки", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(2)));
		
		РодительскийУзел = ДеревоРезультат;
		
		Если ОтображатьКорневойУзел Тогда
			ТипОбъекта		= "";
			ДанныеКартинки	= 0;
			
			Если ТипЗнч(Объект) = Тип("СправочникСсылка.ДоговорыБрокерскогоОбслуживания")
				ИЛИ ТипЗнч(Объект) = Тип("СправочникСсылка.Договоры") Тогда	
				
				ТипОбъекта		= "Договор: ";
				ДанныеКартинки	= 3;
				
			ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.ДепозитарныеСчета") Тогда
				
				Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "ТипСчета") = Перечисления.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета Тогда
					ТипОбъекта		= "Раздел счета: ";
					ДанныеКартинки	= 1;
				Иначе
					ТипОбъекта		= "Счет: ";
					ДанныеКартинки	= 2;
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
				
				ТипОбъекта		= "Счет: ";
				ДанныеКартинки	= 2;
				
			КонецЕсли;
			
			ДочерняяСтрока = ДеревоРезультат.Строки.Добавить();
			ДочерняяСтрока.Элемент			= Объект;
			ДочерняяСтрока.Представление	= ТипОбъекта + Строка(Объект);
			ДочерняяСтрока.ДанныеКартинки	= ДанныеКартинки;
			
			РодительскийУзел = ДочерняяСтрока;
		КонецЕсли;
	КонецЕсли;
	
	

	Если ВидыДоговоровДепозитырныхСчетов.Найти(ВидДоговора) <> Неопределено
	 ИЛИ ВидыДоговоровДепозитырныхСчетов.Найти(ВидОсновногоДоговора) <> Неопределено Тогда
		
		// Добавляем депозитарные счета
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	""Счет: "" КАК ТипОбъекта,
			|	""СправочникСсылка.ДепозитарныеСчета"" КАК ТипЗначенияЭлемента,
			|	2 КАК ДанныеКартинки,
			|	ДепозитарныеСчета.Организация КАК Организация,
			|	ДепозитарныеСчета.Ссылка КАК ДепозитарныйСчет,
			|	ДепозитарныеСчета.Ссылка КАК Элемент,
			|	ДепозитарныеСчета.Наименование КАК Представление
			|ИЗ
			|	Справочник.ДепозитарныеСчета КАК ДепозитарныеСчета
			|ГДЕ
			|	ДепозитарныеСчета.Договор = &Договор
			|	И ДепозитарныеСчета.ПометкаУдаления = ЛОЖЬ
			|	И ДепозитарныеСчета.Родитель = ЗНАЧЕНИЕ(Справочник.ДепозитарныеСчета.ПустаяСсылка)
			|	И &Отбор
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""Доп. соглашение:"",
			|	""СправочникСсылка.Договоры"",
			|	2,
			|	Договоры.Организация КАК Организация,
			|	НЕОПРЕДЕЛЕНО КАК ДепозитарныйСчет,
			|	Договоры.Ссылка,
			|	Договоры.Наименование
			|ИЗ
			|	(ВЫБРАТЬ
			|		Договоры.Ссылка КАК Ссылка,
			|		Договоры.Организация КАК Организация,
			|		Договоры.Наименование КАК Наименование,
			|		ЕСТЬNULL(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗакрытия
			|	ИЗ
			|		Справочник.Договоры КАК Договоры
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних КАК УсловияДоговоровОбщиеСрезПоследних
			|			ПО Договоры.Ссылка = УсловияДоговоровОбщиеСрезПоследних.Договор
			|	ГДЕ
			|		Договоры.Основание = &Договор
			|		И Договоры.ПометкаУдаления = ЛОЖЬ) КАК Договоры
			|ГДЕ
			|	&Отбор");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отбор", ?(Отбор = Неопределено, Истина, Отбор)); 
		Запрос.УстановитьПараметр("Договор", Объект);
		
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.ДепозитарныеСчета") Тогда
		
		// Добавляем разделы депозитарных счетов и исполнителей по ц/б
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	""Раздел счета: "" КАК ТипОбъекта,
			|	""СправочникСсылка.ДепозитарныеСчета"" КАК ТипЗначенияЭлемента,
			|	1 КАК ДанныеКартинки,
			|	ДепозитарныеСчета.Организация КАК Организация,
			|	ДепозитарныеСчета.Ссылка КАК ДепозитарныйСчет,
			|	NULL КАК СчетДоверительногоУправления,
			|	ДепозитарныеСчета.Ссылка КАК Элемент,
			|	ДепозитарныеСчета.Наименование КАК Представление
			|ИЗ
			|	Справочник.ДепозитарныеСчета КАК ДепозитарныеСчета
			|ГДЕ
			|	ДепозитарныеСчета.Родитель = &ДепозитарныйСчет
			|	И ДепозитарныеСчета.ПометкаУдаления = ЛОЖЬ
			|	И &Отбор
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""Исполнитель: "",
			|	""РегистрСведенийКлючЗаписи.ИсполнителиПоЦеннымБумагам"",
			|	0 КАК ДанныеКартинки,
			|	ИсполнителиПоЦеннымБумагам.Организация,
			|	ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет,
			|	ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления,
			|	НЕОПРЕДЕЛЕНО,
			|	ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления.Наименование
			|ИЗ
			|	РегистрСведений.ИсполнителиПоЦеннымБумагам КАК ИсполнителиПоЦеннымБумагам
			|ГДЕ
			|	ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет = &ДепозитарныйСчет
			|	И &Отбор");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отбор", ?(Отбор = Неопределено, Истина, Отбор)); 
		Запрос.УстановитьПараметр("ДепозитарныйСчет", Объект);
		
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.ДоговорыБрокерскогоОбслуживания")
		ИЛИ ВидДоговора = Перечисления.ВидыДоговоров.БрокерскогоОбслуживания Тогда
		
		// Добавляем исполнителей по д/с брокерские
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	""Исполнитель: "" КАК ТипОбъекта,
			|	""РегистрСведенийКлючЗаписи.ИсполнителиПоДенежнымСредствамБрокерские"" КАК ТипЗначенияЭлемента,
			|	0 КАК ДанныеКартинки,
			|	ДоговорыСБрокерами.Организация КАК Организация,
			|	ДоговорыСБрокерами.Брокер КАК Брокер,
			|	ИсполнителиПоДСБрокерские.РасчетныйСчет КАК РасчетныйСчет,
			|	ИсполнителиПоДСБрокерские.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ИсполнителиПоДСБрокерские.СчетДоверительногоУправления.Наименование + "", "" + ИсполнителиПоДСБрокерские.РасчетныйСчет.Наименование КАК Представление
			|ИЗ
			|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(&Период) КАК ДоговорыСБрокерами
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиПоДенежнымСредствамБрокерские КАК ИсполнителиПоДСБрокерские
			|		ПО (ИсполнителиПоДСБрокерские.Организация = ДоговорыСБрокерами.Организация)
			|			И (ИсполнителиПоДСБрокерские.СчетДоверительногоУправления = ДоговорыСБрокерами.СчетДоверительногоУправления)
			|			И (ИсполнителиПоДСБрокерские.Брокер = ДоговорыСБрокерами.Брокер)
			|			И (&Отбор)
			|ГДЕ
			|	ДоговорыСБрокерами.ДоговорБрокерскогоОбслуживания = &Договор");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отбор", ?(Отбор = Неопределено, Истина, Отбор)); 
		Запрос.УстановитьПараметр("Договор", Объект);
		Запрос.УстановитьПараметр("Период", Период);
		
	ИначеЕсли ВидыДоговоровБанковскихСчетов.Найти(ВидДоговора) <> Неопределено
		  ИЛИ ВидыДоговоровБанковскихСчетов.Найти(ВидОсновногоДоговора) <> Неопределено Тогда
		
		// Добавляем банковские счета
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	""Счет: "" КАК ТипОбъекта,
			|	""СправочникСсылка.БанковскиеСчета"" КАК ТипЗначенияЭлемента,
			|	2 КАК ДанныеКартинки,
			|	БанковскиеСчета.Ссылка КАК Элемент,
			|	БанковскиеСчета.Наименование КАК Представление
			|ИЗ
			|	Справочник.БанковскиеСчета КАК БанковскиеСчета
			|ГДЕ
			|	БанковскиеСчета.Договор = &Договор
			|	И БанковскиеСчета.ПометкаУдаления = ЛОЖЬ
			|	И &Отбор
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""Доп. соглашение:"",
			|	""СправочникСсылка.Договоры"",
			|	2,
			|	Договоры.Ссылка,
			|	Договоры.Наименование
			|ИЗ
			|	(ВЫБРАТЬ
			|		Договоры.Ссылка КАК Ссылка,
			|		Договоры.Наименование КАК Наименование,
			|		ЕСТЬNULL(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗакрытия
			|	ИЗ
			|		Справочник.Договоры КАК Договоры
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних КАК УсловияДоговоровОбщиеСрезПоследних
			|			ПО Договоры.Ссылка = УсловияДоговоровОбщиеСрезПоследних.Договор
			|	ГДЕ
			|		Договоры.Основание = &Договор
			|		И Договоры.ПометкаУдаления = ЛОЖЬ) КАК Договоры
			|ГДЕ
			|	&Отбор");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отбор", ?(Отбор = Неопределено, Истина, Отбор)); 
		Запрос.УстановитьПараметр("Договор", Объект);

	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
		
		// Добавляем исполнителей по д/с
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	""Исполнитель: "" КАК ТипОбъекта,
			|	""РегистрСведенийКлючЗаписи.ИсполнителиПоДенежнымСредствамСобственные"" КАК ТипЗначенияЭлемента,
			|	0 КАК ДанныеКартинки,
			|	ИсполнителиПоДССобственные.Организация КАК Организация,
			|	NULL КАК Брокер,
			|	ИсполнителиПоДССобственные.РасчетныйСчет КАК РасчетныйСчет,
			|	ИсполнителиПоДССобственные.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ИсполнителиПоДССобственные.СчетДоверительногоУправления.Наименование КАК Представление
			|ИЗ
			|	РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДССобственные
			|ГДЕ
			|	ИсполнителиПоДССобственные.РасчетныйСчет = &РасчетныйСчет
			|	И (&Отбор)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""Исполнитель (брокерский): "" КАК ТипОбъекта,
			|	""РегистрСведенийКлючЗаписи.ИсполнителиПоДенежнымСредствамБрокерские"" КАК ТипЗначенияЭлемента,
			|	0 КАК ДанныеКартинки,
			|	ИсполнителиПоДСБрокерские.Организация,
			|	ИсполнителиПоДСБрокерские.Брокер,
			|	ИсполнителиПоДСБрокерские.РасчетныйСчет,
			|	ИсполнителиПоДСБрокерские.СчетДоверительногоУправления,
			|	ИсполнителиПоДСБрокерские.СчетДоверительногоУправления.Наименование
			|ИЗ
			|	РегистрСведений.ИсполнителиПоДенежнымСредствамБрокерские КАК ИсполнителиПоДСБрокерские
			|ГДЕ
			|	ИсполнителиПоДСБрокерские.РасчетныйСчет = &РасчетныйСчет
			|	И (&Отбор)");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отбор", ?(Отбор = Неопределено, Истина, Отбор)); 
		Запрос.УстановитьПараметр("РасчетныйСчет", Объект);
		
	КонецЕсли;
	
	Если Запрос <> Неопределено Тогда
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			ВыборкаЗапроса = РезультатЗапроса.Выбрать();
			Пока ВыборкаЗапроса.Следующий() Цикл
				ДочерняяСтрока = РодительскийУзел.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(ДочерняяСтрока, ВыборкаЗапроса);
				
				ДочерняяСтрока.Представление = ВыборкаЗапроса.ТипОбъекта + ВыборкаЗапроса.Представление;
				
				Если ВыборкаЗапроса.ТипЗначенияЭлемента = "РегистрСведенийКлючЗаписи.ИсполнителиПоЦеннымБумагам" Тогда
					
					СтруктураКлюча = Новый Структура("Организация, СчетДоверительногоУправления, ДепозитарныйСчет");
					ЗаполнитьЗначенияСвойств(СтруктураКлюча, ВыборкаЗапроса); 
					ДочерняяСтрока.Элемент = РегистрыСведений.ИсполнителиПоЦеннымБумагам.СоздатьКлючЗаписи(СтруктураКлюча);	
					
				ИначеЕсли ВыборкаЗапроса.ТипЗначенияЭлемента = "РегистрСведенийКлючЗаписи.ИсполнителиПоДенежнымСредствамБрокерские" Тогда
					
					СтруктураКлюча = Новый Структура("Организация, СчетДоверительногоУправления, Брокер, РасчетныйСчет");
					ЗаполнитьЗначенияСвойств(СтруктураКлюча, ВыборкаЗапроса); 
					ДочерняяСтрока.Элемент = РегистрыСведений.ИсполнителиПоДенежнымСредствамБрокерские.СоздатьКлючЗаписи(СтруктураКлюча);	
					
				ИначеЕсли ВыборкаЗапроса.ТипЗначенияЭлемента = "РегистрСведенийКлючЗаписи.ИсполнителиПоДенежнымСредствамСобственные" Тогда
					
					СтруктураКлюча = Новый Структура("Организация, СчетДоверительногоУправления, РасчетныйСчет");
					ЗаполнитьЗначенияСвойств(СтруктураКлюча, ВыборкаЗапроса); 
					ДочерняяСтрока.Элемент = РегистрыСведений.ИсполнителиПоДенежнымСредствамСобственные.СоздатьКлючЗаписи(СтруктураКлюча);	
					
				КонецЕсли;
				
				ПолучитьДочерниеЭлементы(ДочерняяСтрока.Элемент, Период, Отбор, Ложь, УникальныйИдентификаторФормы, ДочерняяСтрока);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	РодительскийУзел = Неопределено; // чтобы не возвращался несериализуемый тип	
	
	Если ЭтоКорневойУзел Тогда	
		Если УникальныйИдентификаторФормы = Неопределено Тогда
			Возврат ДеревоРезультат;				
		КонецЕсли;
		
		Возврат ПоместитьВоВременноеХранилище(ДеревоРезультат, УникальныйИдентификаторФормы);
	КонецЕсли;
	
	Возврат Неопределено;		
	
КонецФункции

Процедура ЗакрытьДеревоЭлементов(ДеревоЭлементов, ДатаЗакрытия, Отказ = Ложь) Экспорт
	
	НачатьТранзакцию();
	
	ЗакрытьДеревоЭлементовРекурсивно(ДеревоЭлементов, ДатаЗакрытия, Отказ);		

	Если Отказ = Ложь Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗакрытьДеревоЭлементовРекурсивно(ДеревоЭлементов, ДатаЗакрытия, Отказ = Ложь, РодительскийУзел = Неопределено)
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если РодительскийУзел = Неопределено Тогда
		Если ЭтоАдресВременногоХранилища(ДеревоЭлементов) Тогда
			РодительскийУзел = ПолучитьИзВременногоХранилища(ДеревоЭлементов);
		Иначе
			РодительскийУзел = ДеревоЭлементов;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого ДочернийЭлемент Из РодительскийУзел.Строки Цикл
		ЗакрытьДеревоЭлементовРекурсивно(ДеревоЭлементов, ДатаЗакрытия, Отказ, ДочернийЭлемент);			
		
		Если Отказ = Истина Тогда
			Возврат;
		КонецЕсли;
		
		Если ДочернийЭлемент.Отметка Тогда
			
			Если ТипЗнч(ДочернийЭлемент.Элемент) = Тип("РегистрСведенийКлючЗаписи.ИсполнителиПоЦеннымБумагам")
				ИЛИ ТипЗнч(ДочернийЭлемент.Элемент) = Тип("РегистрСведенийКлючЗаписи.ИсполнителиПоДенежнымСредствамБрокерские")
				ИЛИ ТипЗнч(ДочернийЭлемент.Элемент) = Тип("РегистрСведенийКлючЗаписи.ИсполнителиПоДенежнымСредствамСобственные") Тогда	
				
				// Исполнители
				
				ОбъектМетаданных	= Метаданные.НайтиПоТипу(ТипЗнч(ДочернийЭлемент.Элемент));
				ЗакрываемыйОбъект	= РегистрыСведений[ОбъектМетаданных.Имя].СоздатьМенеджерЗаписи();
				
				ЗаполнитьЗначенияСвойств(ЗакрываемыйОбъект, ДочернийЭлемент.Элемент); 
				
				ЗакрываемыйОбъект.Прочитать();
				Если Не ЗакрываемыйОбъект.Выбран() Тогда
					Продолжить;
				КонецЕсли;
				
				ЗакрываемыйОбъект.ДатаЗакрытия = ДатаЗакрытия;
				
			ИначеЕсли ТипЗнч(ДочернийЭлемент.Элемент) = Тип("СправочникСсылка.ДоговорыБрокерскогоОбслуживания") 
				ИЛИ ТипЗнч(ДочернийЭлемент.Элемент) = Тип("СправочникСсылка.Договоры") Тогда 

				ЗакрываемыйОбъект	= РегистрыСведений.УсловияДоговоровОбщие.СоздатьМенеджерЗаписи();
				ЗакрываемыйОбъект.Договор			= ДочернийЭлемент.Элемент;
				ЗакрываемыйОбъект.Период			= ДатаЗакрытия;
				ЗакрываемыйОбъект.ДатаРасторжения	= ДатаЗакрытия;
				
			Иначе
				
				// Депозитарный счет / Раздел депозитарного счета / Банковский счет
				
				ЗакрываемыйОбъект = ДочернийЭлемент.Элемент.ПолучитьОбъект();
				ЗакрываемыйОбъект.ДатаЗакрытия = ДатаЗакрытия;
				
			КонецЕсли;
			
			Попытка
				ЗакрываемыйОбъект.Записать();
			Исключение
				РасшифровкаОшибки = ИнформацияОбОшибке();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(РасшифровкаОшибки), ЗакрываемыйОбъект, , , Отказ);
				Возврат;
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	//РодительскийУзел = Неопределено; // чтобы не возвращался несериализуемый тип	
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОВЕРКА СУЩЕСТВОВАНИЯ ИСПОЛНИТЕЛЕЙ

Функция ЕстьИсполнитель(ИмяРегистраИсполнителей, РеквизитыИсполнителя) Экспорт
	
	// дата, организация и счет доверительного управления обязательны для заполнения
	// у всех видов исполнителей
	Если Не ЗначениеЗаполнено(РеквизитыИсполнителя.Организация)
		Или Не ЗначениеЗаполнено(РеквизитыИсполнителя.СчетДоверительногоУправления)
		Или Не ЗначениеЗаполнено(РеквизитыИсполнителя.Дата)
	Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",                  РеквизитыИсполнителя.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", РеквизитыИсполнителя.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ДатаЗакрытия",                 НачалоДня(РеквизитыИсполнителя.Дата));
	
	Если       ИмяРегистраИсполнителей = "ИсполнителиПоДенежнымСредствамСобственные" Тогда
		// проверять имеет смысл только тогда, когда р/счет выбран
		Если Не ЗначениеЗаполнено(РеквизитыИсполнителя.РасчетныйСчет) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет
			|ИЗ
			|	РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
			|ГДЕ
			|	(ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия >= &ДатаЗакрытия
			|			ИЛИ ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))
			|	И ИсполнителиПоДенежнымСредствамСобственные.Организация = &Организация
			|	И ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет = &РасчетныйСчет";
			
		Запрос.УстановитьПараметр("РасчетныйСчет", РеквизитыИсполнителя.РасчетныйСчет);
			
	ИначеЕсли ИмяРегистраИсполнителей = "ИсполнителиПоДенежнымСредствамБрокерские" Тогда
		// проверять имеет смысл только тогда, когда р/счет выбран
		Если Не ЗначениеЗаполнено(РеквизитыИсполнителя.РасчетныйСчет) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИсполнителиПоДенежнымСредствамБрокерские.РасчетныйСчет
			|ИЗ
			|	РегистрСведений.ИсполнителиПоДенежнымСредствамБрокерские КАК ИсполнителиПоДенежнымСредствамБрокерские
			|ГДЕ
			|	(ИсполнителиПоДенежнымСредствамБрокерские.ДатаЗакрытия >= &ДатаЗакрытия
			|			ИЛИ ИсполнителиПоДенежнымСредствамБрокерские.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))
			|	И ИсполнителиПоДенежнымСредствамБрокерские.Организация = &Организация
			|	И ИсполнителиПоДенежнымСредствамБрокерские.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И ИсполнителиПоДенежнымСредствамБрокерские.РасчетныйСчет = &РасчетныйСчет
			|	И ИсполнителиПоДенежнымСредствамБрокерские.Брокер = &Брокер";
		
		Запрос.УстановитьПараметр("РасчетныйСчет", РеквизитыИсполнителя.РасчетныйСчет);
		Запрос.УстановитьПараметр("Брокер",        РеквизитыИсполнителя.Брокер);
		
	ИначеЕсли ИмяРегистраИсполнителей = "ИсполнителиПоЦеннымБумагам" Тогда
		// проверять имеет смысл только тогда, когда счет депо выбран
		Если Не ЗначениеЗаполнено(РеквизитыИсполнителя.ДепозитарныйСчет) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет
			|ИЗ
			|	РегистрСведений.ИсполнителиПоЦеннымБумагам КАК ИсполнителиПоЦеннымБумагам
			|ГДЕ
			|	(ИсполнителиПоЦеннымБумагам.ДатаЗакрытия >= &ДатаЗакрытия
			|			ИЛИ ИсполнителиПоЦеннымБумагам.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))
			|	И ИсполнителиПоЦеннымБумагам.Организация = &Организация
			|	И ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет = &ДепозитарныйСчет";
			
		Запрос.УстановитьПараметр("ДепозитарныйСчет", РеквизитыИсполнителя.ДепозитарныйСчет);
		
	КонецЕсли;
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции // ЕстьИсполнитель
